<!DOCTYPE html
     PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
     "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>CSS + XHTML, Proyecto Camale&oacute;n - Dise&ntilde;o No.1, El Camale&oacute;n</title>
<meta http-equiv="Content-Language" content="es" />
<meta name="Author" content="Manuel Guerrero - ideasfreelance.com" />
<meta name="Keywords" content="css, hojas de estilos, estandares, xhtml, separacion, contenido, diseno" />
<meta name="Description" content="CSS + XHTML, Proyecto Camale&oacute;n - El Camale&oacute;n" />
<link rel="stylesheet" type="text/css" href="/estilos/1/estilos.css" media="all" />
<link rel="alternate" type="application/rss+xml" title="RSS 2.0" href="http://www.camaleoncss.com/ultimos.rss" />
</head>
<body>
<div id="contenido">

	<div id="encabezado">

	<h1><span>Camale&oacute;n CSS</span></h1>
	</div>

	<div id="explicacion">
		<h2><span>Separando contenido y presentaci&oacute;n</span></h2>
				<p>Desde hace algunos a&ntilde;os se encuentran disponibles ciertas tecnolog&iacute;as que permiten la separaci&oacute;n del contenido y el dise&ntilde;o de los sitios web. Sin embargo estas tecnolog&iacute;as no han sito aprovechadas tan ampliamente como se supondr&iacute;a al conocer sus ventajas inherentes, esto se debe principalmente a la falta de difusi&oacute;n de su existencia y sus ventajas, tanto entre los creadores de p&aacute;ginas web como entre las empresas, personas e instituciones que las utilizan.</p>

				<blockquote><div class="quote">CSS dar&aacute; la libertad a los expertos del dise&ntilde;o --artistas, dise&ntilde;adores gr&aacute;ficos y tip&oacute;grafos-- de determinar los aspectos est&eacute;ticos de un sitio, independientemente de su contenido.</div>
				<div><cite>Dan Shafer</cite></div></blockquote>

				<p>Estas tecnolog&iacute;as de las que estamos hablando son <acronym title="Cascading Style Sheets, Hojas de estilo en cascada">CSS</acronym> y <acronym title="(eXtensible) Hypertext Markup Language, Lenguaje de marcado de hipertexto (extensible)">(X)HTML</acronym>. Estas tecnolog&iacute;as o lenguajes, utilizados seg&uacute;n su definici&oacute;n por la instancia que elabora las recomendaciones (tambi&eacute;n conocidos como los est&aacute;ndares), el <acronym title="World Wide Web Consortium">W3C</acronym>, representan un gran paso hacia el futuro de las comunicaciones en l&iacute;nea al permitir que los expertos en contenido y programaci&oacute;n se ocupen de lo suyo, permitiendo a los expertos en dise&ntilde;o hacerse cargo de los aspectos est&eacute;ticos.</p>

	</div>

	<div id="proyecto">
		<h2><span>El Proyecto</span></h2>
			<h3><span>Inspiraci&oacute;n</span></h3>
				<p>El proyecto <span class="camaleon">Camale&oacute;n CSS</span> ha sido inspirado por la idea y concepto original del <a href="http://www.csszengarden.com" title="CSS Zen Garden">CSS Zen Garden</a>, creado por Dave Shea, un dise&ntilde;ador web de Vancouver Canad&aacute;. Que a su vez fue inspirado por otros proyectos con la misma idea de fondo.</p>

			<h3><span>Objetivo</span></h3>
				<p>El objetivo de este proyecto es demostrar como un mismo documento puede ser visualizado de muchas formas diferentes en base a la aplicaci&oacute;n de diferentes hojas de estilos. Esto pudiera parecer a simple vista un juego de webmasters, pero en el fondo puede reflejarse su utilidad en el campo de los negocios, al convertir las tareas de redise&ntilde;o web en una asignaci&oacute;n a los creativos, en lugar de ser todo un nuevo proyecto a cargo de editores, programadores y dise&ntilde;adores.</p>
				<p class="resaltar">En efecto, todos los dise&ntilde;os que puedes ver desde esta p&aacute;gina usan exactamente el mismo documento <acronym title="eXtensible Hypertext Markup Language, Lenguaje de marcado de hipertexto extensible">XHTML</acronym> como base, lo &uacute;nico que cambia es la hoja de estilos aplicada.</p>

	</div>

	<div id="participa">
		<h2><span>Participa!</span></h2>
			<h3><span>Aporta tu dise&ntilde;o</span></h3>
				<p>El &eacute;xito de este proyecto depender&aacute; en forma definitiva de la cantidad y calidad de los dise&ntilde;os expuestos, por lo que invito a todos los dise&ntilde;adores web, dise&ntilde;adores gr&aacute;ficos y artistas a participar de este proyecto con dise&ntilde;os de calidad y creativos.</p>

				<p>Si eres un dise&ntilde;ador pero no conoces a ciencia cierta lo que implica el desarrollar una hoja de estilos, no te preocupes, <a href="http://www.ideasfreelance.com/archives/2004/10/30/recursos_css/" title="Recursos sobre CSS">Aqu&iacute; encontrar&aacute;s muchos tutoriales y art&iacute;culos</a> que te ayudar&aacute;n a afinar tus conocimientos.</p>
				<p><span class="envia">Para enviar tu dise&ntilde;o, <a href="http://www.camaleoncss.com/herramientas/participa.html" title="Env&iacute;a tu dise&ntilde;o">entra a la p&aacute;gina con los requisitos y las instrucciones de env&iacute;o.</a></span></p>

			<h3><span>Difunde y usa</span></h3>
				<p>Ayuda a dar a conocer este proyecto entre las comunidades de dise&ntilde;adores, webmasters, artistas gr&aacute;ficos y similares. Este proyecto depende de la participaci&oacute;n de todos, y mientras m&aacute;s dise&ntilde;adores participen, m&aacute;s completo y enriquecedor resultar&aacute;. As&iacute; que agradecer&eacute; cualquier enlace desde tu blog, website, foro, firma, etc&eacute;tera. <a href="http://www.camaleoncss.com/herramientas/difunde.html" title="Ayuda a difundir el proyecto">en esta p&aacute;gina puedes encontrar como hacerlo.</a></p>

	</div>

	<div id="disenos">
		<h2><span>Los Dise&ntilde;os</span></h2>
			<p>Selecciona cualquier dise&ntilde;o para verlo en acci&oacute;n en esta misma p&aacute;gina</p>
				<ul id="estilos">
									<li><span class="enlace"><a href="/55/p1/camaleon.html" title="Ver este dise&ntilde;o de Nelson Caldas">Matrix</a></span> <span class="autor">por Nelson Caldas</span></li>

									<li><span class="enlace"><a href="/54/p1/camaleon.html" title="Ver este dise&ntilde;o de Henar F&eacute;rnandez">Fuerteventura</a></span> <span class="autor">por Henar F&eacute;rnandez</span></li>
									<li><span class="enlace"><a href="/53/p1/camaleon.html" title="Ver este dise&ntilde;o de Marian Santa Eulalia">A Mano</a></span> <span class="autor">por Marian Santa Eulalia</span></li>
									<li><span class="enlace"><a href="/52/p1/camaleon.html" title="Ver este dise&ntilde;o de Javier Moreno Jabardo">Vistamosal</a></span> <span class="autor">por Javier Moreno Jabardo</span></li>
									<li><span class="enlace"><a href="/51/p1/camaleon.html" title="Ver este dise&ntilde;o de Jos&eacute; Ram&oacute;n L&oacute;pez Fern&aacute;ndez">Orqu&iacute;dea</a></span> <span class="autor">por Jos&eacute; Ram&oacute;n L&oacute;pez Fern&aacute;ndez</span></li>

									<li><span class="enlace"><a href="/50/p1/camaleon.html" title="Ver este dise&ntilde;o de Guillermo Cruz">Vacaciones</a></span> <span class="autor">por Guillermo Cruz</span></li>
								</ul>
				<div id="paginas"><span>P&aacute;ginas: </span>
<a title="Ir a la p&aacute;gina 1" href="/1/p1/camaleon.html" class="actual">1</a>
<a title="Ir a la p&aacute;gina 2" href="/1/p2/camaleon.html">2</a>
<a title="Ir a la p&aacute;gina 3" href="/1/p3/camaleon.html">3</a>

<a title="Ir a la p&aacute;gina 4" href="/1/p4/camaleon.html">4</a>
<a title="Ir a la p&aacute;gina 5" href="/1/p5/camaleon.html">5</a>
<a title="Ir a la p&aacute;gina 6" href="/1/p6/camaleon.html">6</a>
<a title="Ir a la p&aacute;gina 7" href="/1/p7/camaleon.html">7</a>
<a title="Ir a la p&aacute;gina 8" href="/1/p8/camaleon.html">8</a>
<a title="Ir a la p&aacute;gina 9" href="/1/p9/camaleon.html">9</a>
<a title="Ir a la p&aacute;gina 10" href="/1/p10/camaleon.html">10</a>
</div>
	</div>


	<div id="elautor">
		<h2><span>El Autor de este dise&ntilde;o</span></h2>
				<p><span class="atributo">Nombre:</span> <span class="valor">Manuel Guerrero</span></p>
				<p><span class="atributo">Pa&iacute;s:</span> <span class="valor">M&eacute;xico</span></p>

				<p><span class="atributo">P&aacute;gina Web:</span> <span class="valor"><a href="http://www.ideasfreelance.com" title="Visita la p&aacute;gina de Manuel Guerrero">http://www.ideasfreelance.com</a></span></p>
				<p><span class="atributo">Perfil:</span> <span class="valor">Especialista en negocios por internet, director de Convergensys.com y creador del proyecto Camale&oacute;nCSS. Involucrado con internet desde 1993. Impulsor de los est&aacute;ndares web a trav&eacute;s de su blog personal, ideasfreelance.com</span></p>
	</div>

	<div id="agradecimientos">

		<h2><span>Agradecimientos</span></h2>
				<p>Gracias a todos los que han hecho posible este proyecto, y a todos los que participar&aacute;n para hacerlo crecer. Gracias tambi&eacute;n a los websites para dise&ntilde;adores web por hacer posible que existan webmasters de calidad en el mundo de habla hispana, <a href="http://www.maestrosdelweb.com" title="Maestros del Web">Maestros del Web</a>,  <a href="http://www.desarrolloweb.com" title="Desarrollo Web">Desarrollo Web</a>, <a href="http://www.webestilo.com" title="Web Estilo">Web Estilo</a>, <a href="http://www.webtaller.com/" title="Web Taller">Web Taller</a>, <a href="http://www.programacion.net/" title="Web Taller">Programaci&oacute;n</a>, y todos los dem&aacute;s.</p>

	</div>
</div>

	<div id="legal">
				<p>(cc) Some Rights Reserved (Algunos derechos reservados). El contenido de este sitio se publica bajo <a href="http://creativecommons.org/licenses/by-nc/2.0/deed.es" title="Licencia Creative Commons">Licencia Creative Commons</a>. Los diseños expuestos por los diferentes participantes son propiedad de cada uno de ellos, y no pueden usarse para ning&uacute;n otro fin sin su consentimiento escrito.</p>
	</div>

	<div id="extra1"><span></span></div>
	<div id="extra2"><span></span></div>

	<div id="extra3"><span></span></div>
	<div id="extra4"><span></span></div>
	<div id="extra5"><span></span></div>
	<div id="extra6"><span></span></div>
</body>
</html>